//Да се напише програма во која од стандарден влез прво се внесува еден позитивен цел број z, а потоа последователно се
// внесуваат парови цели броеви (a, b). Внесувањето на парови цели броеви треба да заврши кога корисникот ќе го внесе парот (0, 0). Треба да се пресмета колку
// пати z е еднаков на збирот на секој внесен пар броеви a и b, како и колкав процент од вкупниот број внесени парови (a, b)
// даваат збир z (ЗАБЕЛЕШКА: парот (0, 0) не се зема во предвид при извршувањето на пресметките!).
#include<iostream>
using namespace std;
int main() {
    float z,a=1,b=1,brojac=0,br1=0,procenti=0,br2=0;
    cin>>z;
    while(a!=0 && b!=0) {
        cin>>a>>b;
        br1++;
        if(a+b==z) {
            brojac++;
        }
    }
    br2=br1-1;
    procenti=(brojac/br2)*100;
    cout<<procenti;
    return 0;
}