/* Од стандарден влез се читаат знаци се додека не се прочита извичник.
 * Во вака внесениот текст се скриени цели броеви (помали од 100).
 * Да се напише програма што ќе ги прочита сите знаци
 * и на излез ќе го испечати збирот на сите броеви скриени во текстот.
Напомена: cin во C++ ги игнорира празните места (space). За да не ги игнорира потребно е да се додаде noskipws
пред читањето на знакот (пр. cin >> noskipws >> znak;)
 */
#include<iostream>
using namespace std;
int main() {
 char c;
 int b=0;
 while(true) {
  cin>>noskipws>>c;
  if(c=='!') {
   break;
  }
  if(c>='A' && c<='Z') {
   continue;
  }
  if(c>='0' && c<='9') {
   b+=c-'0';
  }
 }
 cout<<b<<endl;
 }