#include<iostream>
using namespace std;

int main() {
    int n;
    cin >> n;  // Внесуваме број на елементи во низата
    int a[n];   // Првата низа (оригинална низа)
    int b[n];   // Втората низа (новата низа)

    // Вчитување на елементите во првата низа
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }

    // Индекс за позицијата во втората низа
    int j = 0;

    // Прво додаваме позитивни броеви во втората низа
    for (int i = 0; i < n; i++) {
        if (a[i] >= 0) {
            b[j] = a[i];
            j++;  // Преместуваме на следниот слободен простор
        }
    }

    // Втор циклус за додавање на негативни броеви во втората низа
    for (int i = 0; i < n; i++) {
        if (a[i] < 0) {
            b[j] = a[i];
            j++;  // Преместуваме на следниот слободен простор
        }
    }

    // Печатење на втората низа
    for (int i = 0; i < n; i++) {
        cout << b[i] << " ";
    }

    return 0;
}
