#include<iostream>
#include<cstring> // За strlen
using namespace std;

int main() {
    int k;
    cin >> k;  // Прочитај го бројот на повторувања
    cin.ignore();  // Овој метод го игнорира новиот ред од претходното внесување
    char str[50];  // Поголема низа за внесување на линија
    cin.getline(str, 50);  // Прочитај ја целата линија

    int len = strlen(str);  // Големината на низата

    // Поголем индекс за новата низа
    char result[50];  // Поголема низа за да може да ги вметнувате повторените самогласки
    int resIndex = 0;   // Индекс за новата низа

    // Прво обработување на линијата
    for (int i = 0; i < len; i++) {
        // Проверка дали е самогласка
        if (str[i] == 'a' || str[i] == 'e' || str[i] == 'i' || str[i] == 'o' || str[i] == 'u' ||
            str[i] == 'A' || str[i] == 'E' || str[i] == 'I' || str[i] == 'O' || str[i] == 'U') {

            // Повторување на самогласката k пати
            for (int j = 0; j < k; j++) {
                result[resIndex++] = str[i];  // Додај ја самогласката k пати
            }
            } else {
                result[resIndex++] = str[i];  // Ако не е самогласка, само додај ја
            }
    }

    result[resIndex] = '\0';  // Заврши ја новата низа со терминирачки карактер

    cout << result << endl;  // Печати ја новата трансформирана линија
    return 0;
}