#include<iostream>
using namespace std;

int main() {
    int N, n, a[10];
    cin >> N;

    for(int i = 0; i < N; i++) {
        cin >> n;  // Внесуваме големина на низата
        for(int k = 0; k < n; k++) {
            cin >> a[k];  // Внесуваме елементи во низата
        }

        int m = a[0];  // Првиот елемент е бројот кој го одредува колку да се преместуваат елементите

        if(m > 0) {
            // Ако m е позитивен, преместуваме на десно за m позиции
            for(int j = n - 1; j >= m; j--) {
                a[j] = a[j - m];
            }
            // Пополнуваме со нули на почетокот на низата
            for(int j = 0; j < m; j++) {
                a[j] = 0;
            }
        }
        else if(m < 0) {
            // Ако m е негативен, преместуваме на лево за |m| позиции
            for(int j = 0; j < n + m; j++) {
                a[j] = a[j - m];
            }
            // Пополнуваме со нули на крајот на низата
            for(int j = n + m; j < n; j++) {
                a[j] = 0;
            }
        }

        // Печатење на новата низа
        for(int j = 0; j < n; j++) {
            cout << a[j] << " ";
        }
        cout << endl;
    }

    return 0;
}